{
  "format": "layers-model",
  "generatedBy": "keras v2.13.1",
  "convertedBy": "TensorFlow.js Converter v4.8.0",
  "modelTopology": {
    "keras_version": "2.13.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 512],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [null, 140],
              "input_dim": 52000,
              "output_dim": 512,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 140
            },
            "name": "embedding",
            "inbound_nodes": [[["input_1", 0, 0, {}]]]
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "name": "spatial_dropout1d",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            },
            "name": "spatial_dropout1d",
            "inbound_nodes": [[["embedding", 0, 0, {}]]]
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "lstm",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 150,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": { "seed": null },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": { "gain": 1.0, "seed": null },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.1,
                  "implementation": 1
                },
                "registered_name": null
              },
              "merge_mode": "concat"
            },
            "name": "bidirectional",
            "inbound_nodes": [[["spatial_dropout1d", 0, 0, {}]]]
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 52,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": { "seed": null },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                },
                "registered_name": null
              }
            },
            "name": "time_distributed",
            "inbound_nodes": [[["bidirectional", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_1", 0, 0]],
        "output_layers": [["time_distributed", 0, 0]]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": false,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of27.bin",
        "group1-shard2of27.bin",
        "group1-shard3of27.bin",
        "group1-shard4of27.bin",
        "group1-shard5of27.bin",
        "group1-shard6of27.bin",
        "group1-shard7of27.bin",
        "group1-shard8of27.bin",
        "group1-shard9of27.bin",
        "group1-shard10of27.bin",
        "group1-shard11of27.bin",
        "group1-shard12of27.bin",
        "group1-shard13of27.bin",
        "group1-shard14of27.bin",
        "group1-shard15of27.bin",
        "group1-shard16of27.bin",
        "group1-shard17of27.bin",
        "group1-shard18of27.bin",
        "group1-shard19of27.bin",
        "group1-shard20of27.bin",
        "group1-shard21of27.bin",
        "group1-shard22of27.bin",
        "group1-shard23of27.bin",
        "group1-shard24of27.bin",
        "group1-shard25of27.bin",
        "group1-shard26of27.bin",
        "group1-shard27of27.bin"
      ],
      "weights": [
        {
          "name": "bidirectional/forward_lstm/lstm_cell/kernel",
          "shape": [512, 600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell/recurrent_kernel",
          "shape": [150, 600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell/bias",
          "shape": [600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell/kernel",
          "shape": [512, 600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell/recurrent_kernel",
          "shape": [150, 600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell/bias",
          "shape": [600],
          "dtype": "float32"
        },
        {
          "name": "embedding/embeddings",
          "shape": [52000, 512],
          "dtype": "float32"
        },
        {
          "name": "time_distributed/kernel",
          "shape": [300, 52],
          "dtype": "float32"
        },
        { "name": "time_distributed/bias", "shape": [52], "dtype": "float32" }
      ]
    }
  ]
}
